nxp-mcuxpresso/mcuxsdk-middleware-usb/example/boards/frdmmcxn236_om13790host/usb_pd_alt_mode_dp_host/freertos/pin_mux.c
    gpio_pin_config_t ORIENT_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_14 (pin H17)  */
    GPIO_PinInit(BOARD_INITPINS_ORIENT_GPIO, BOARD_INITPINS_ORIENT_PIN, &ORIENT_config);

    gpio_pin_config_t DC_BARREL_PRES_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_17 (pin K15)  */
    GPIO_PinInit(BOARD_INITPINS_DC_BARREL_PRES_GPIO, BOARD_INITPINS_DC_BARREL_PRES_PIN, &DC_BARREL_PRES_config);

    /* EFT detect interrupts configuration on PORT0_ */
    PORT_DisableEFTDetectInterrupts(PORT0, 0xA00000u);

    /* PORT0_21 (pin A8) is configured as PIO0_21 */
    PORT_SetPinMux(BOARD_INITPINS_EXTRA_EN_SRCn_PORT, BOARD_INITPINS_EXTRA_EN_SRCn_PIN, kPORT_MuxAlt0);

    PORT0->PCR[21] =
        ((PORT0->PCR[21] &
          /* Mask bits to zero which are setting */
          (~(PORT_PCR_PE_MASK | PORT_PCR_SRE_MASK | PORT_PCR_PFE_MASK | PORT_PCR_ODE_MASK | PORT_PCR_DSE_MASK | PORT_PCR_IBE_MASK | PORT_PCR_INV_MASK)))

         /* Pull Enable: Disables. */
         | PORT_PCR_PE(PCR_PE_pe0)

         /* Slew Rate Enable: Fast. */
         | PORT_PCR_SRE(PCR_SRE_sre0)

         /* Passive Filter Enable: Disables. */
         | PORT_PCR_PFE(PCR_PFE_pfe0)

         /* Open Drain Enable: Disables. */
         | PORT_PCR_ODE(PCR_ODE_ode0)

         /* Drive Strength Enable: High. */
         | PORT_PCR_DSE(PCR_DSE_dse1)

         /* Input Buffer Enable: Enables. */
         | PORT_PCR_IBE(PCR_IBE_ibe1)

         /* Invert Input: Does not invert. */
         | PORT_PCR_INV(PCR_INV_inv0));

    /* PORT0_23 (pin B7) is configured as PIO0_23 */
    PORT_SetPinMux(BOARD_INITPINS_nALERT_PORT, BOARD_INITPINS_nALERT_PIN, kPORT_MuxAlt0);

    PORT0->PCR[23] =
        ((PORT0->PCR[23] &
          /* Mask bits to zero which are setting */
          (~(PORT_PCR_PE_MASK | PORT_PCR_SRE_MASK | PORT_PCR_ODE_MASK | PORT_PCR_DSE_MASK | PORT_PCR_IBE_MASK | PORT_PCR_INV_MASK)))

         /* Pull Enable: Disables. */
         | PORT_PCR_PE(PCR_PE_pe0)

         /* Slew Rate Enable: Fast. */
         | PORT_PCR_SRE(PCR_SRE_sre0)

         /* Open Drain Enable: Disables. */
         | PORT_PCR_ODE(PCR_ODE_ode0)

         /* Drive Strength Enable: High. */
         | PORT_PCR_DSE(PCR_DSE_dse1)

         /* Input Buffer Enable: Enables. */
         | PORT_PCR_IBE(PCR_IBE_ibe1)

         /* Invert Input: Does not invert. */
         | PORT_PCR_INV(PCR_INV_inv0));

    /* EFT detect interrupts configuration on PORT1_ */
    PORT_DisableEFTDetectInterrupts(PORT1, 0x0300u);

    /* PORT1_8 (pin A1) is configured as FC4_P0 */
    PORT_SetPinMux(PORT1, 8U, kPORT_MuxAlt2);

    PORT1->PCR[8] =
        ((PORT1->PCR[8] &
          /* Mask bits to zero which are setting */
          (~(PORT_PCR_PE_MASK | PORT_PCR_SRE_MASK | PORT_PCR_PFE_MASK | PORT_PCR_ODE_MASK | PORT_PCR_DSE_MASK | PORT_PCR_IBE_MASK | PORT_PCR_INV_MASK)))

         /* Pull Enable: Disables. */
         | PORT_PCR_PE(PCR_PE_pe0)

         /* Slew Rate Enable: Fast. */
         | PORT_PCR_SRE(PCR_SRE_sre0)

         /* Passive Filter Enable: Disables. */
         | PORT_PCR_PFE(PCR_PFE_pfe0)

         /* Open Drain Enable: Disables. */
         | PORT_PCR_ODE(PCR_ODE_ode0)

         /* Drive Strength Enable: Low. */
         | PORT_PCR_DSE(PCR_DSE_dse0)

         /* Input Buffer Enable: Enables. */
         | PORT_PCR_IBE(PCR_IBE_ibe1)

         /* Invert Input: Does not invert. */
         | PORT_PCR_INV(PCR_INV_inv0));

    /* PORT1_9 (pin B1) is configured as FC4_P1 */
    PORT_SetPinMux(PORT1, 9U, kPORT_MuxAlt2);

    PORT1->PCR[9] =
        ((PORT1->PCR[9] &
          /* Mask bits to zero which are setting */
          (~(PORT_PCR_PE_MASK | PORT_PCR_SRE_MASK | PORT_PCR_PFE_MASK | PORT_PCR_ODE_MASK | PORT_PCR_DSE_MASK | PORT_PCR_IBE_MASK | PORT_PCR_INV_MASK)))

         /* Pull Enable: Disables. */
         | PORT_PCR_PE(PCR_PE_pe0)

         /* Slew Rate Enable: Fast. */
         | PORT_PCR_SRE(PCR_SRE_sre0)

         /* Passive Filter Enable: Disables. */
         | PORT_PCR_PFE(PCR_PFE_pfe0)

         /* Open Drain Enable: Disables. */
         | PORT_PCR_ODE(PCR_ODE_ode0)

         /* Drive Strength Enable: Low. */
         | PORT_PCR_DSE(PCR_DSE_dse0)

         /* Input Buffer Enable: Enables. */
         | PORT_PCR_IBE(PCR_IBE_ibe1)

         /* Invert Input: Does not invert. */
         | PORT_PCR_INV(PCR_INV_inv0));

    /* EFT detect interrupts configuration on PORT2_ */
    PORT_DisableEFTDetectInterrupts(PORT2, 0x81u);

    /* PORT2_0 (pin H2) is configured as PIO2_0 */
    PORT_SetPinMux(BOARD_INITPINS_DP4LANE_PORT, BOARD_INITPINS_DP4LANE_PIN, kPORT_MuxAlt0);

    PORT2->PCR[0] =
        ((PORT2->PCR[0] &
          /* Mask bits to zero which are setting */
          (~(PORT_PCR_PE_MASK | PORT_PCR_SRE_MASK | PORT_PCR_ODE_MASK | PORT_PCR_DSE_MASK | PORT_PCR_IBE_MASK | PORT_PCR_INV_MASK)))

         /* Pull Enable: Disables. */
         | PORT_PCR_PE(PCR_PE_pe0)

         /* Slew Rate Enable: Fast. */
         | PORT_PCR_SRE(PCR_SRE_sre0)

         /* Open Drain Enable: Disables. */
         | PORT_PCR_ODE(PCR_ODE_ode0)

         /* Drive Strength Enable: High. */
         | PORT_PCR_DSE(PCR_DSE_dse1)

         /* Input Buffer Enable: Enables. */
         | PORT_PCR_IBE(PCR_IBE_ibe1)

         /* Invert Input: Does not invert. */
         | PORT_PCR_INV(PCR_INV_inv0));

    /* PORT2_7 (pin L2) is configured as PIO2_7 */
    PORT_SetPinMux(BOARD_INITPINS_P0_XSD_PORT, BOARD_INITPINS_P0_XSD_PIN, kPORT_MuxAlt0);

    PORT2->PCR[7] =
        ((PORT2->PCR[7] &
          /* Mask bits to zero which are setting */
          (~(PORT_PCR_PE_MASK | PORT_PCR_SRE_MASK | PORT_PCR_ODE_MASK | PORT_PCR_DSE_MASK | PORT_PCR_IBE_MASK | PORT_PCR_INV_MASK)))

         /* Pull Enable: Disables. */
         | PORT_PCR_PE(PCR_PE_pe0)

         /* Slew Rate Enable: Fast. */
         | PORT_PCR_SRE(PCR_SRE_sre0)

