nxp-mcuxpresso/mcuxsdk-middleware-usb/example/boards/frdmmcxn236_om13790host/usb_pd_alt_mode_dp_host/freertos/pin_mux.c
         /* Open Drain Enable: Disables. */
         | PORT_PCR_ODE(PCR_ODE_ode0)

         /* Drive Strength Enable: High. */
         | PORT_PCR_DSE(PCR_DSE_dse1)

         /* Input Buffer Enable: Enables. */
         | PORT_PCR_IBE(PCR_IBE_ibe1)

         /* Invert Input: Does not invert. */
         | PORT_PCR_INV(PCR_INV_inv0));

    /* EFT detect interrupts configuration on PORT3_ */
    PORT_DisableEFTDetectInterrupts(PORT3, 0x025000u);

    /* PORT3_12 (pin G16) is configured as PIO3_12 */
    PORT_SetPinMux(BOARD_INITPINS_DP_HPD_PORT, BOARD_INITPINS_DP_HPD_PIN, kPORT_MuxAlt0);

    PORT3->PCR[12] =
        ((PORT3->PCR[12] &
          /* Mask bits to zero which are setting */
          (~(PORT_PCR_PE_MASK | PORT_PCR_SRE_MASK | PORT_PCR_ODE_MASK | PORT_PCR_DSE_MASK | PORT_PCR_IBE_MASK | PORT_PCR_INV_MASK)))

         /* Pull Enable: Disables. */
         | PORT_PCR_PE(PCR_PE_pe0)

         /* Slew Rate Enable: Fast. */
         | PORT_PCR_SRE(PCR_SRE_sre0)

         /* Open Drain Enable: Disables. */
         | PORT_PCR_ODE(PCR_ODE_ode0)

         /* Drive Strength Enable: High. */
         | PORT_PCR_DSE(PCR_DSE_dse1)

         /* Input Buffer Enable: Enables. */
         | PORT_PCR_IBE(PCR_IBE_ibe1)

         /* Invert Input: Does not invert. */
         | PORT_PCR_INV(PCR_INV_inv0));

    /* PORT3_14 (pin H17) is configured as PIO3_14 */
    PORT_SetPinMux(BOARD_INITPINS_ORIENT_PORT, BOARD_INITPINS_ORIENT_PIN, kPORT_MuxAlt0);

    PORT3->PCR[14] =
        ((PORT3->PCR[14] &
          /* Mask bits to zero which are setting */
          (~(PORT_PCR_PE_MASK | PORT_PCR_SRE_MASK | PORT_PCR_ODE_MASK | PORT_PCR_DSE_MASK | PORT_PCR_IBE_MASK | PORT_PCR_INV_MASK)))

         /* Pull Enable: Disables. */
         | PORT_PCR_PE(PCR_PE_pe0)

         /* Slew Rate Enable: Fast. */
         | PORT_PCR_SRE(PCR_SRE_sre0)

         /* Open Drain Enable: Disables. */
         | PORT_PCR_ODE(PCR_ODE_ode0)

         /* Drive Strength Enable: High. */
         | PORT_PCR_DSE(PCR_DSE_dse1)

         /* Input Buffer Enable: Enables. */
         | PORT_PCR_IBE(PCR_IBE_ibe1)

         /* Invert Input: Does not invert. */
         | PORT_PCR_INV(PCR_INV_inv0));

    /* PORT3_17 (pin K15) is configured as PIO3_17 */
    PORT_SetPinMux(BOARD_INITPINS_DC_BARREL_PRES_PORT, BOARD_INITPINS_DC_BARREL_PRES_PIN, kPORT_MuxAlt0);

    PORT3->PCR[17] =
        ((PORT3->PCR[17] &
          /* Mask bits to zero which are setting */
          (~(PORT_PCR_PE_MASK | PORT_PCR_SRE_MASK | PORT_PCR_ODE_MASK | PORT_PCR_DSE_MASK | PORT_PCR_IBE_MASK | PORT_PCR_INV_MASK)))

         /* Pull Enable: Disables. */
         | PORT_PCR_PE(PCR_PE_pe0)

         /* Slew Rate Enable: Fast. */
         | PORT_PCR_SRE(PCR_SRE_sre0)

         /* Open Drain Enable: Disables. */
         | PORT_PCR_ODE(PCR_ODE_ode0)

         /* Drive Strength Enable: High. */
         | PORT_PCR_DSE(PCR_DSE_dse1)

         /* Input Buffer Enable: Enables. */
         | PORT_PCR_IBE(PCR_IBE_ibe1)

         /* Invert Input: Does not invert. */
         | PORT_PCR_INV(PCR_INV_inv0));
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
I2C2_InitPins:
- options: {createDeInit: 'true', callFromInitBoot: 'false', coreID: cm33_core0, enableClock: 'true', customDeInitName: I2C2_DeinitPins}
- pin_list:
  - {pin_num: F6, peripheral: LP_FLEXCOMM5, signal: LPFLEXCOMM_P0, pin_signal: PIO1_16/WUU0_IN14/FC5_P0/FC3_P4/CT_INP12/FLEXIO0_D24/I3C1_SDA/ADC1_A16, eft_interrupt: disable,
    slew_rate: fast, open_drain: disable, drive_strength: high, pull_enable: disable, passive_filter: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: F4, peripheral: LP_FLEXCOMM5, signal: LPFLEXCOMM_P1, pin_signal: PIO1_17/FC5_P1/FC3_P5/CT_INP13/FLEXIO0_D25/I3C1_SCL/ADC1_A17, eft_interrupt: disable,
    slew_rate: fast, open_drain: disable, drive_strength: high, pull_enable: disable, passive_filter: disable, input_buffer: enable, invert_input: normal}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : I2C2_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void I2C2_InitPins(void)
{
    /* Enables the clock for PORT1: Enables clock */
    CLOCK_EnableClock(kCLOCK_Port1);

    /* EFT detect interrupts configuration on PORT1_ */
    PORT_DisableEFTDetectInterrupts(PORT1, 0x030000u);

    /* PORT1_16 (pin F6) is configured as FC5_P0 */
    PORT_SetPinMux(PORT1, 16U, kPORT_MuxAlt2);

    PORT1->PCR[16] =
        ((PORT1->PCR[16] &
          /* Mask bits to zero which are setting */
          (~(PORT_PCR_PE_MASK | PORT_PCR_SRE_MASK | PORT_PCR_PFE_MASK | PORT_PCR_ODE_MASK | PORT_PCR_DSE_MASK | PORT_PCR_IBE_MASK | PORT_PCR_INV_MASK)))

         /* Pull Enable: Disables. */
         | PORT_PCR_PE(PCR_PE_pe0)

         /* Slew Rate Enable: Fast. */
         | PORT_PCR_SRE(PCR_SRE_sre0)

         /* Passive Filter Enable: Disables. */
         | PORT_PCR_PFE(PCR_PFE_pfe0)

         /* Open Drain Enable: Disables. */
         | PORT_PCR_ODE(PCR_ODE_ode0)

         /* Drive Strength Enable: High. */
         | PORT_PCR_DSE(PCR_DSE_dse1)

         /* Input Buffer Enable: Enables. */
         | PORT_PCR_IBE(PCR_IBE_ibe1)

         /* Invert Input: Does not invert. */
         | PORT_PCR_INV(PCR_INV_inv0));

    /* PORT1_17 (pin F4) is configured as FC5_P1 */
    PORT_SetPinMux(PORT1, 17U, kPORT_MuxAlt2);

    PORT1->PCR[17] =
        ((PORT1->PCR[17] &
          /* Mask bits to zero which are setting */
          (~(PORT_PCR_PE_MASK | PORT_PCR_SRE_MASK | PORT_PCR_PFE_MASK | PORT_PCR_ODE_MASK | PORT_PCR_DSE_MASK | PORT_PCR_IBE_MASK | PORT_PCR_INV_MASK)))

         /* Pull Enable: Disables. */
         | PORT_PCR_PE(PCR_PE_pe0)

         /* Slew Rate Enable: Fast. */
         | PORT_PCR_SRE(PCR_SRE_sre0)

         /* Passive Filter Enable: Disables. */
         | PORT_PCR_PFE(PCR_PFE_pfe0)

